//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//!
//!	IRFAN FAHMI RAMADHAN
//!
//!	2016/5/24
//!	
//!	LogoScene.h
//!
//! Copyright ©2016 IrGame All Right Reserved
//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
//---------------------------------------------------------------------
#ifndef __LOGOSCENE_H__
#define __LOGOSCENE_H__

//--------------------------
#include "cocos2d.h"
//--------------------------

//---------------------------------------------------------------------
class LogoScene : public cocos2d::Layer
{
	//-----------------------------------------------------------------------
private:
	void changeScene(float dt);				//シーン移動

	//---------------------------------------------------------------------
public:
	//--------------------------------------
	static cocos2d::Scene* createScene();	//シーン作成
	virtual bool init();					//初期化
	CREATE_FUNC(LogoScene);				
	
	//--------------------------------------

	bool onTouchBegan(cocos2d::Touch *touch, cocos2d::Event *unused_event);

	//-----------------------------------------------------------------------
};
#endif